Revit 2024 API
Connector.IsConnectedTo Method
Identifies if the connector is connected to the specified connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsConnectedTo(
	Connector connector
)
Visual Basic
Public Function IsConnectedTo ( _
	connector As Connector _
) As Boolean
Visual C++
public:
bool IsConnectedTo(
	Connector^ connector
)
Parameters
connector
Type: Autodesk.Revit.DB.Connector
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the argument is null.
See Also
Connector Class
Autodesk.Revit.DB Namespace